Public Attributes | List of all members
API_Prim_Head Struct Reference
Geometry | Library Part Management
Header information for primitive elements. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_PrimTypeID  | typeID
Type of the primitive element (see API_PrimTypeID).
 API_AttributeIndex  | layer
Layer attribute index of the parent element.
 API_ExtendedPenType  | pen
(Overridden) pen attribute index of the primitive element.
 short  | drwIndex
Drawing order index of the original element if the primitive element is a part of the content of a drawing element generated from a view.
 API_RenovationStatusType  | renovationStatus
Renovation Status of the original element.
Detailed Description
Header information for primitive elements.